from __future__ import annotations


WORK_POINT_LABELS = {
    "1": "Пункт 1",
    "2": "Пункт 2",
    "3": "Пункт 3",
    "4": "Пункт 4",
    "5": "Пункт 5",
    "6": "Пункт 6",
    "7": "Пункт 7",
    "8": "Срок устранения замечаний по АПП",
    "9": "АВР",
    "10": "Вентиляция",
    "11": "Стены. Потолки (штукатурка/шпаклёвка)",
    "12": "Возведение коробки здания",
    "13": "Работы по устройству подстилающего слоя",
    "14": "Работы по устройству гидроизоляции пола в с/у",
    "15": "Работы по возведению блочных перегородок",
    "16": "Разнорабочие",
    "17": "Работы по монтажу ПВХ блоков",
    "18": "Работы по монтажу откосов и подоконников",
    "19": "Ростелеком",
    "20": "Работы по монтажу холодного витражного остекления балконов",
    "21": "Работы по монтажу системы отопления",
    "22": "Работы по монтажу канализации, в/с",
    "23": "Работы по монтажу входных дверей",
    "24": "Электрика",
    "25": "Прочее",
    "26": "Отступное (ТМЦ)",
}


CONTRACTOR_POINT_LABELS = WORK_POINT_LABELS
